run/hartmann/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1; // OJM40
    rho             rho [ 1 -3 0 0 0 0 0 ] 1; // OJM40;
    conductivity    conductivity [-1 -3 3 0 0 2 0] 1; // OJM40
    mu		    mu [ 1 1 -2 0 0 -2 0 ] 1; // OJM40
}

phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1; // OJM40
    rho             rho [ 1 -3 0 0 0 0 0 ] 1; // OJM40;
    conductivity    conductivity [-1 -3 3 0 0 2 0] 1; // OJM40
    mu		    mu [ 1 1 -2 0 0 -2 0 ] 1; // OJM40
}

sigma           sigma [1 0 -2 0 0 0 0] 1;

curvatureModel
{
    type interpolationSmoothedCSFAlpha;
    nSmoothingIters 1;
}

// ************************************************************************* //
