run/hartmann/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(pd)        interfaceGauss linear;
    snGradCorr(pd)  interfaceGauss linear;
    grad((DBU*magSqr(B))) Gauss linear;	// OJM40
}

divSchemes
{
    div(phi,U)  Gauss linearUpwindV grad(U);
    div(phi,alpha)  Gauss vanLeer01;
    div(phirb,alpha) Gauss vofCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,k) Gauss upwind;
    div(phi,epsilon) Gauss upwind;

    // OJM40
    div(phiB,U)     Gauss linear; // OJM40
    div(phi,B)      Gauss linear; // OJM40
    div(phiB,((2*DBU)*B)) Gauss linear; // OJM40
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(rAU,pd) interfaceGauss linear interfaceCorrected;

    // OJM40
    laplacian(nu,U) Gauss linear corrected; // OJM40
    laplacian((1|A(U)),p) Gauss linear corrected; // OJM40
    laplacian(DB,B) Gauss linear corrected; // OJM40
    laplacian((1|A(B)),pB) Gauss linear corrected; // OJM40
}

interpolationSchemes
{
    default         linear;

    // OJM40
    interpolate(HbyA) linear; // OJM40
    interpolate(B)  linear; // OJM40
}

snGradSchemes
{
    default         corrected;
    snGrad(pd)      interfaceCorrected;
}


// ************************************************************************* //
